<template>
    <FactModal 
        class="fact-component"
        :img="img"
        @close="close" 
    > 
        <div class="scrollable-text mt-2 info">
            <p>
                19 июня ароматы для дома смогут создать наши коллеги из Новосибирска, а для онлайн-участников мы подготовили несколько инструкций и советов.<br><br>
                Для изготовления своего аромата вам потребуется:<br><br>
                - Стеклянный флакон или небольшая стеклянная бутылка;<br>
                - набор эфирных масел;<br>
                - пипетка, ложка, воронка;<br>
                - наклейки (белые стикеры);<br>
                - фломастеры для подписи;<br>
                - диффузорные палочки;<br>
                - декоративные элементы;<br>
                - Защита для стола, пола и одежды: клеенка, фартук.<br>
                <br>
                1. Подготовьте все необходимые материалы и инструменты.<br><br>
                2. Защитите рабочую поверхность клеенкой, чтобы не испачкать стол.<br><br>
                3. С помощью воронки налейте в стеклянный флакон или бутылку эфирные масла. Можно использовать одно или комбинацию различных масел для создания уникального аромата.<br>
                <br>
                Рекомендации по смешиванию<br><br>
                Сочетание эфирных масел для лучшего фокуса и внимания:<br><br>
                1\3 флакона масла розмарина;<br>
                2\3 флакона масла мяты перечной.<br>
                <br>
                Сочетание эфирных масел для релаксации и крепкого сна:<br><br>
                2\4 флакона масла мандарина;<br>
                1\4 флакона масла нероли;<br>
                1\4 флакона розового масла.<br>
                <br>
                Сочетание эфирных масел, поднимающее настроение:<br><br>
                1\4 флакона бергамота;<br>
                1\4 флакона герани;<br>
                2\4 флакона розы.<br>
                <br>
                4. Подготовьте диффузорные палочки, которые будут пропитываться маслами и распространять аромат в помещении.<br><br>
                5. Вставьте палочки в флакон и оставьте на несколько часов или даже на ночь.<br><br>
                6. Если у вас есть декоративные элементы, прикрепите их к флакону с помощью наклеек.<br><br>
                7. Используйте фломастеры для подписи флакона, указывая на его содержимое.<br><br>
                Ваш уникальный аромат для дома готов!
            </p>
        </div>
    </FactModal>
</template>

<script lang="ts" setup>
import FactModal from "@/components/FactModal.vue";
import img from "@/assets/pics/aromat.jpg";

const emit = defineEmits(['close', 'quiz']);


function close() {
    emit('close');
}

</script>

<style lang="scss">


</style>