<template>
    <FactModal 
        class="fact-component"
        :img="img"
        @close="close" 
    > 
        <div class="scrollable-text mt-2 info">
            <p>
                Наши коллеги в Санкт-Петербурге сегодня украшают свои вкусные коктейли с мороженым, а для вас мы подготовили проверенные рецепты, по которым можно сделать вкусный и полезный коктейль в домашних условиях. 
                <br>
                Выберите понравившийся вам рецепт и не бойтесь импровизировать!<br>
                Для приготовления каждого коктейля вам потребуется:
                <br>
                - Блендер;<br>
                - Защита для стола и одежду: скатерть/клеенка и фартук;<br>
                - Разделочная доска;<br>
                - Ножик;<br>
                - Мерный стакан;<br>
                - Стакан для готового напитка;<br>
                - Ингредиенты.<br>
                <br>
                Рецепт №1. Клубничный коктейль.<br><br>
                Дополнительно потребуется:<br>
                - Украшения для готового коктейля (зонтик, разноцветные трубочки, клубничная долька);<br>
                - 300 грамм клубники;<br>
                - 500 мл молока;<br>
                - 200 грамм ванильного мороженого.<br>

                <br>
                1. Застелите поверхность стола клеенкой и наденьте фартук.<br><br>
                2. Если вы используете свежую клубнику, то ее стоит хорошо промыть, переложить на разделочную доску и удалить хвостики.<br><br>
                3. Переложите в блендер мороженое и залейте молоком.<br><br>
                4. Добавьте очищенные и нарезанные ягоды клубники в блендер.<br><br>
                5. Перемешайте все ингредиенты в блендере на высокой скорости до получения красивой пенки.<br><br>
                6. Перелейте готовый коктейль в стакан и украсьте зонтиком, разноцветными трубочками и половинкой клубники.<br><br>
                Поздравляем! Ваш летний клубничный коктейль готов!<br><br>
                <br>
                Рецепт №2. Шоколадный коктейль.<br><br>
                Для приготовления шоколадного коктейля вам потребуется:<br>
                Дополнительно потребуется:<br>
                - Глубокая алюминиевая чаша;<br>
                - Кастрюля;<br>
                - Силиконовая лопатка для помешивания;<br>
                - Украшения для готового коктейля (Зонтик, разноцветные трубочки, печенье, вафельные трубочки, взбитые сливки, топпинг);<br>
                - 400 мл молока;<br>
                - 110 грамм мороженого пломбир;<br>
                - 60 грамм темного шоколада.<br>

                <br><br>
                Способ приготовления:<br><br>
                1. Застелите поверхность стола клеенкой и наденьте фартук.<br><br>
                2. Наберите в кастрюлю воды, поставьте на плиту и доведите до кипения.<br><br>
                3. Положите в алюминиевую чашу темный шоколад и немного молока. Затем поставьте чашу на кастрюлю с кипящей водой, создав водяную баню для растопки шоколада.
Чтобы шоколад равномерно растаял и не прилип к краям чаши, не забывайте постоянно помешивать его силиконовой лопаткой.<br><br>
                4. Перелейте в блендер холодное молоко.<br><br>
                5. Добавьте в него растопленный шоколад и мороженое. <br><br>
                6. Перемешайте ингредиенты на максимальной скорости до появления пены.
                Это примерно 1,5 минуты.<br><br>
                7. Перелейте готовый коктейль в стакан и украсьте коктейль зонтиком, разноцветными трубочками, добавьте взбитые сливки и топпинг, вставьте вафельные трубочки и печенье.<br><br>
                Поздравляем! Ваш нежный шоколадный коктейль готов!<br><br>
            </p>
        </div>
    </FactModal>
</template>

<script lang="ts" setup>
import FactModal from "@/components/FactModal.vue";
import img from "@/assets/pics/cocktail.jpg";

const emit = defineEmits(['close', 'quiz']);


function close() {
    emit('close');
}

</script>

<style lang="scss">


</style>