<template>
    <FactModal 
        class="fact-component"
        :img="img"
        @close="close" 
    > 
        <div class="scrollable-text mt-2 info">
            <p> 

            <b>Дорогие друзья,</b><br><br>
            <b>Команда CLT по популяризации миссии благодарит всех участников творческого конкурса рисунков на тему:</b><br>
            «Создаем больше чем просто продукты и несем добро в каждый дом». 
            Каждый из вас великолепно справился с задачей и креативно подошел к отражению миссии нашей компании. 
            Это еще раз продемонстрировало нам, что миссия «Юнилевер» для каждого из нас звучит по разному, но всегда связана с положительными эмоциями, общением и теплотой.<br><br> 

            В результате голосования, команда CLT приняла решение наградить всех участников конкурса.<br>
            <b>Призы и имена их получателей представлены ниже:</b><br>
            <b>Толстовка и зарядка:</b><br>
            Оксана Нистратова<br>  
            Наталья Ротанина<br>
            Сергей Ледовский<br>

            <b>Футболка:</b><br> 
            Татьяна Дернова<br> 
            Тарас Казаков<br> 
            Светлана Константинова<br> 
            Виктория Евсеенко<br> 
            Алена Судоплатова<br> 
            Николай Кочнев<br>

            <b>Бутылочка для воды:</b><br> 
            Светлана Соловьева<br> 
            Юлия Петрова<br> 
            Екатерина Щербакова<br> 
            Надежда Жогло<br> 
            Екатерина Чиргина<br> 
            Валентина Белоусова<br> 
            Отдельную благодарность от команды получает рисунок Марии Лакисовой за выдающуюся креативность и неожиданный сюжет – ей вручается толстовка и бутылочка для воды.<br><br> 

            <b>Все призы изготовлены из переработанных материалов и поддерживают стремление бережнее относиться к ресурсам планеты.</b><br><br>

            Сотрудники Московского офиса могут получить свои призы у Натальи Корнауховой, а с сотрудниками из других городов по доставке свяжется Полина Демчук.<br><br>

            <b>Желаем вам как можно больше добрых моментов и поздравляем нас всех с Днем рождения нашей компании!</b><br><br>
            </p>
            <div class="flex justify-end">
                <Like class="mr-5" :event_id="props.event_id" />
            </div>
        </div>
    </FactModal>
</template>

<script lang="ts" setup>
import FactModal from "@/components/FactModal.vue";
import img from "@/assets/pics/culture.jpg";
import { defineProps, defineEmits } from 'vue';
import Like from "@/components/Like.vue";

const emit = defineEmits(['close', 'quiz']);


function close() {
    emit('close');
}

const props = defineProps({
    event_id: {
        type: String,
        required: true
    }
});


</script>

<style lang="scss">


</style>