<template>
    <FactModal 
        class="fact-component"
        :img="img"
        @close="close" 
    > 
        <div class="scrollable-text mt-2 info">
            <p>
                Дай вторую жизнь старому носку или чулку!<br> В Екатеринбурге наши коллеги сегодня будут учиться делать травянчиков. <br>А вам, дорогие друзья, потребуются:<br><br>
                - Опилки;<br>
                - Перчатки;<br>
                - Семена газонной травы или злаков (ячмень, пшеница) (2-3 ст.л.);<br>
                - Ножницы;<br>
                - Глазки-наклейки;<br>
                - Ложка;<br>
                - Капроновые чулки, колготки;<br>
                - Защита для пола, стола и одежды: клеенка, фартук, перчатки.<br>
                <br>
                1.Застелите поверхность стола пленкой и наденьте перчатки и фартук. <br><br>
                2. Возьмите чулок или колготки, отрежьте часть так, чтобы остался нетронутым носок.<br><br>
                3. Возьмите ложку и насыпьте в чулок 2-3 столовые ложки семян. Распределите семена в том месте, где вы хотите, чтобы росла травка.<br><br>
                4. Набейте чулок опилками. Не бойтесь приминать опилки, чтобы влезло больше. У вас должен получиться плотный мешочек.<br><br>
                5. Когда наберется достаточно опилок, завяжите кончик чулка капроновым обрезком и ножницами обрежьте излишки.<br><br>
                6. Теперь можно приступить к формированию будущего травянчика. Здесь уже всё зависит от вашей фантазии: отделите небольшое количество опилок и сделайте, например, носик. Завяжите его небольшим отрезком капроновой ленты. Так можно сделать всё, что хотите: мордочку, ушки, лапки и прочее.<br><br>
                7. По желанию можно «оживить» травянчика и раскрасить его акриловыми красками, а также приклеить глазки.<br><br>
                Вот и всё, ваш травянчик готов!
            </p>
        </div>
    </FactModal>
</template>

<script lang="ts" setup>
import FactModal from "@/components/FactModal.vue";
import img from "@/assets/pics/grass.jpg";

const emit = defineEmits(['close', 'quiz']);


function close() {
    emit('close');
}

</script>

<style lang="scss">


</style>