<template>
    <FactModal 
        class="fact-component"
        :img="img"
        @close="close" 
    > 
        <div class="scrollable-text mt-2 info">
            <p>
                Вместе с мастерами свою собственную бумагу смогут сделать наши коллеги на фабрике в Омске. А для вас, дорогие друзья, мы подготовили подробную инструкцию для изготовления бумаги в домашних условиях.<br><br> Вам потребуются: <br>
                - Салфетки, туалетная бумага, открытки, бумажные календари, обои, картон,  ячейки из под яиц и прочее; <br>
                - клей ПВА;<br>
                - защита для стола, пола и одежды: клеенка, фартук;<br>
                - блендер;<br>
                - губка;<br>
                - специальная сетка (рамка, сетка, степлер);<br>
                - глубокая емкость;<br>
                - поднос;<br>
                - ненужная хлопковая ткань.<br>
                <br>
                Инструкция по изготовлению бумаги:<br><br>
                1. Застелите поверхность стола пленкой и наденьте перчатки и фартук. <br><br>
                2. Соберите ненужные листы бумаги.<br><br>
                3. Разорвите или порежьте бумагу на мелкие кусочки.<br><br>
                4. Далее все кусочки бумаги переложите в глубокую емкость, залейте кипятком и дайте им размокнуть в течение 30-45 минут.<br><br>
                Совет: Не жалейте воды, залейте кусочки по самый край и даже больше. В процессе работы вам, вероятно, придется подливать воду, так как она впитается в бумагу.<br><br>
                5. Теперь, когда бумага стала мокрой и более гибкой, необходимо сделать из нее бумажную массу. Для этого нужно достать блендер и хорошенько размять кусочки в кашицу. Чем лучше вы их разобьете, тем более равномерной будет итоговая бумага.<br><br>
                6. После того как вы приготовили бумажную массу, не вынимая её из блендера, добавьте связующее вещество — клей ПВА (примерно 1 столовую ложку на блендер). Затем снова тщательно перемешайте всё в блендере.<br><br>
                7. Чтобы придать нашей будущей бумаге форму, нужно сделать рамку, вам понадобится одна рама с натянутой сеткой, которая не будет растягиваться от воды или деформироваться, например, фатин или москитная сетка, и вторая рама такого же размера, просто пустая, чтобы ровно ограничить формат листов.<br><br>
                8. После того, как основные приготовления завершены, мы переходим с вами к самому интересному — процессу изготовления бумаги. <br><br>
                Для этого нам понадобится сетка, на которую мы будем накладывать нашу бумагу. <br><br>
                9. Достаем неглубокую тару, в которую будет удобно целиком опускать и доставать наши рамки, наливаем туда воду и добавляем часть бумажной каши, разводим до равномерного состояния.<br><br>
                10. Накладываем пустую рамку на рамку с сеткой, чтобы было плотное прилегание и ограничение для бумаги, и опускаем в эту воду. Аккуратно даем распределиться по поверхности и горизонтально вынимаем. Затем даём стечь лишней жидкости.<br><br>
                11. Раскладываем мягкую ткань, лучше хлопок, гладкую, которую не жалко, и переворачиваем рамку с бумагой на нее. Сверху сетку промакиваем впитывающим полотенцем, чтобы сразу убрать максимум жидкости. Затем рамку убираем и вот лист уже почти готов!<br><br>
                12. Таким образом делаем листы, пока бумага не перестанет нужным слоем набираться на сетку.<br><br>
                13. Финальный шаг: оставьте все листы бумаги полностью просохнуть на сутки.<br><br>
                14. Через сутки, убедившись, что листы бумаги полностью высохли, снимите получившуюся бумагу.<br><br>
                Поздравляем! Ваша бумага готова!
            </p>
        </div>
    </FactModal>
</template>

<script lang="ts" setup>
import FactModal from "@/components/FactModal.vue";
import img from "@/assets/pics/paper.jpg";

const emit = defineEmits(['close', 'quiz']);


function close() {
    emit('close');
}

</script>

<style lang="scss">


</style>