<template>
    <FactModal 
        class="fact-component"
        :img="img"
        @close="close" 
    > 
        <div class="scrollable-text mt-2 info ">
            <h1 class="mb-5 text-sm">Уважаемые коллеги,</h1>
            <p>
                Каждому из нас важно получать признание собственных успехов и заслуг в профессиональной жизни - это помогает перезаряжать нашу эмоциональную батарейку и дарит моменты радости и счастья в рабочих буднях.<br><br>
                Признание заслуг сотрудников – важная часть культуры Unilever! Мы очень любим говорить друг другу спасибо и вместе праздновать общие достижения. Но признание - это не только про спасибо, оно может быть уникальным для каждого из нас.<br><br>
                Сегодня мы хотим попросить вас поделиться своими мыслями о том, что такое признание именно для вас? Что заставляет вас чувствовать себя счастливыми на работе? Какие моменты наполняют вас радостью и гордостью? <br><br>
                Переходите по <a class="href underlined-text" href="https://forms.yandex.ru/cloud/6672e480068ff0141763c73c/">ссылке</a>, делитесь вашими размышлениями и ассоциациями и получите приятный бонус – <a class="underlined-text href" href="https://disk.yandex.ru/d/eVbp8KlcYeYAog">видео</a> с <a class="info">Еленой Тябутовой</a> о ее видении и самом запоминающемся примере признания в Unilever! <br><br>
                Напоминаем вам, что возможность поблагодарить коллегу – всегда у вас под рукой! В мобильном приложении <a class="info">UHRCare</a>, в модуле <a class="info">БлагодарЮ</a> вы можете оперативно отправить коллеге слова признания за проделанную работу и проявленные стандарты лидерства.<br><br>
                Присоединяйтесь к потоку признательности, который преодолел рубеж уже в <a class="info">1000+ благодарностей!</a><br><br>
                А мы с радостью поздравляем самых активных участников проекта <a class="info">БлагодарЮ</a> – тех, кто был наиболее щедрым на благодарности и тех, кто получил наибольшее количество теплых слов от коллег:<br>
                <a class="info">Бокова Ксения, Будина Анастасия, Венкова Анна, Войнова Оксана, Кочеткова Елена, Кутьенков Сергей, Лыткина Ольга, Нечаенко Юлия, Никулушкина Анна, Руденко Татьяна, Садыков Максим, Шлейзе Елена, Юшин Никита.</a><br><br>
                Поздравляем коллег! За получением подарка Вы можете обратиться к <a class="info">Новиковой Анне - Anna.S.Novikova@unilever-rus.ru.</a><br><br>
                <a  class="info">
                С уважением,<br>
                Отдел по работе с персоналом </a><br><br>
                <a class="info">#смелость</a> <a class="info">развиваться</a> <a class="info">#смелость</a> <a class="info">вдохновлять</a>
            </p>
            <div class="flex justify-end">
                <Like class="mr-5" :event_id="props.event_id" />
            </div>
        </div>
    </FactModal>
</template>

<script lang="ts" setup>
import Like from "@/components/Like.vue";
import FactModal from "@/components/FactModal.vue";
import img from "@/assets/pics/priznanie.jpg";
const emit = defineEmits(['close', 'quiz']);
import { defineProps } from 'vue';

const props = defineProps({
    event_id: String
});

function close() {
    emit('close');
}

</script>

<style lang="scss">


</style>