<template>
    <FactModal 
        class="fact-component"
        :img="img"
        @close="close" 
    > 
        <div class="scrollable-text mt-2 info">
            <p>
                Мастер класс по смузи проходит в Омске в офисе, а для наших онлайн-участников размещаем несколько рецептов и инструкции. <br>
                Смузи — это не только вкусный, но и полезный завтрак, лёгкий перекус или угощение для детей. Эти напитки представляют собой густую однородную массу с приятной текстурой.<br> 
                Выберите понравившийся вам рецепт и не бойтесь импровизировать!<br><br>
                Для приготовления любого смузи вам потребуется: <br><br>
                - Блендер;<br>
                - Защита для стола и одежды: скатерть/клеенка и фартук;<br>
                - Разделочная доска;<br>
                - Ножик;<br>
                - Стакан для готового напитка;<br>
                - Ингредиенты по рецепту.<br>
                <br><br>
                Рецепт №1. Зеленый смузи.<br><br>
                Для приготовления вам потребуется:<br><br>
                -  2 спелых киви;<br>
                -  1 зеленое кисло-сладкое яблоко;<br>
                -  1 стебель сельдерея;<br>
                -  2 веточки зеленого базилика;<br>
                -  100 мл кефира или воды;<br>
                - 10 грамм меда или 1 спелый банан в качестве подсластителя.<br>
                <br><br>
                
                Способ приготовления:<br><br>
                1. Застелите поверхность стола клееной и наденьте фартук, чтобы защититься от пятен в процессе работы. <br><br>
                2. Помойте все фрукты, овощи и зелень.<br><br>
                3. Киви, яблоко и сельдерей необходимо очистить от жесткой кожуры с помощью ножа.<br><br>
                4. Фрукты с сельдереем положите на разделочную доску и нарежьте небольшими кусочками.<br><br>
                5. Переложите вымытый базилик на разделочную доску и мелко нарежьте. <br><br>
                6. Переложите все ингредиенты в блендер, измельчите, добавьте воду или кефир и снова взбейте.<br><br>
                7. Перелейте смузи в стакан.<br><br>
                Поздравляем! Ваш освежающий зеленый смузи готов!<br>
                <br><br>
                Рецепт №2. Морковный смузи.<br><br>
                Для приготовления морковного смузи вам потребуется:<br><br>
                - Терка;<br>
                - Ручная соковыжималка; <br>
                - 2 стебля сельдерея;<br>
                - 2 крупные моркови;<br>
                - 1 апельсин;<br>
                - 10 грамм меда.<br>
                <br><br>
                Способ приготовления:<br><br>
                1. Застелите поверхность стола клеенкой и наденьте фартук, чтобы защититься от пятен в процессе работы. <br><br>
                2. Помойте все фрукты и овощи.<br><br>
                3. С помощью ножа очистите морковь и натрите на мелкой терке.  <br><br>
                4. Очищенные черешки сельдерея нарежьте тонкими ломтиками поперек на разделочной доске.<br><br>
                5. Соедините в блендере все ингредиенты и измельчайте их в течение 2-х минут.<br><br>
                6. С помощью ручной соковыжималки выдавите из апельсина сок. <br><br>
                7. К измельченным ингредиентам добавьте апельсиновый сок и мед, снова все перемешайте.<br><br>
                8. Перелейте смузи в стакан.<br><br>
                Поздравляем! Ваш тонизирующий морковный смузи готов!<br>
                <br><br>
                Рецепт №3. Витаминный смузи из фруктов.<br><br>
                Для приготовления витаминного смузи вам потребуется:<br><br>
                - Ручная соковыжималка; <br>
                - 1 яблоко;<br>
                - 1 груша;<br>
                - 1 банан;<br>
                - 3 апельсина;<br>
                - 30 грамм голубики или черной смородины.<br>
                <br><br>
                Способ приготовления:<br><br>
                1. Застелите поверхность стола клеенкой и наденьте фартук, чтобы защититься от пятен в процессе работы. <br><br>
                2. Помойте все фрукты и овощи.<br><br>
                3. С помощью ручной соковыжималки выдавите из апельсина сок. <br><br>
                4. Вымытые яблоко и грушу очистите с помощью ножа, положите на разделочную доску и нарежьте дольками, вырезая сердцевину.<br><br>
                5. Очистите банан и нарежьте дольками. <br><br>
                6. Переложите все ингредиенты в блендер, залейте апельсиновым соком и смешайте на высокой скорости. <br><br>
                7. Перелейте смузи в стакан.<br><br>
                Поздравляем! Ваш летний витаминный смузи готов!
            </p>
        </div>
    </FactModal>
</template>

<script lang="ts" setup>
import FactModal from "@/components/FactModal.vue";
import img from "@/assets/pics/smoothie.jpg";

const emit = defineEmits(['close', 'quiz']);


function close() {
    emit('close');
}

</script>

<style lang="scss">


</style>