<template>
    <FactModal 
        class="fact-component"
        :img="img"
        @close="close" 
    > 
        <div class="scrollable-text mt-2 info">
            <p>
                Мыло помогает нам очищать поверхности, а мы предлагаем вам использовать его для того, чтобы что-то "испачкать". <br>
                Вместе с нашими мастерами в Туле мы подготовили инструкцию для создания мыльных картин. <br><br>Вам понадобится:<br>
                - Защита для стола, пола и одежды: клеенка, фартук;<br>
                - Мыльный раствор;<br>
                - Красители (гуашь, акварель, пищевые);<br>
                - Трубочки пластиковые;<br>
                - Плотная бумага;<br>
                - Глубокие тарелки;<br>
                - Ложка;<br>
                - По желанию: карандаши, маркеры, восковые карандаши и прочее.<br>
                <br>
                1. Застелите поверхность стола пленкой и наденьте перчатки и фартук. <br><br>
                2. Сделайте мыльный раствор: смешайте обычную воду и мыло (жидкое или натертое кусковое): на 100 граммов 1 столовую ложку. <br><br>
                Разлейте мыльный раствор по емкостям (тарелкам). Добавьте достаточное количество красителя или краски, чтобы цвет получился насыщенным.<br><br>
                3. Подготовьте плотную бумагу и трубочки.<br><br>
                4. Опустите в приготовленный раствор трубочку и дуйте, пока не появится высокая шапка пены.<br><br>
                5. Приложите к пене лист бумаги один или несколько раз, дождитесь, когда пузырьки в пене лопнут, а на бумаге останутся красивые следы с необычным сетчатым узором.<br><br>
                6. После того, как на бумаге останутся красивые следы с необычным сетчатым узором, вы можете дополнить свой рисунок цветными линиями: нарисовать мордочку животного, очертание облака и прочее.<br><br>
            </p>
        </div>
    </FactModal>
</template>

<script lang="ts" setup>
import FactModal from "@/components/FactModal.vue";
import img from "@/assets/pics/soap.jpg";

const emit = defineEmits(['close', 'quiz']);


function close() {
    emit('close');
}

</script>

<style lang="scss">


</style>