<template>
    <FactModal 
        class="fact-component"
        :img="img"
        @close="close" 
    > 
        <div class="scrollable-text mt-2 info">
            <p>
                Мастер-класс по росписи<br>
                <br>
                Сегодня сразу в нескольких городах у наших сотрудников есть возможность проявить свою дизайнерскую жилку и стать художниками!<br>
                Записывайтесь на мастер-класс и приходите к нам на локацию.<br>
                <br>
                В домашних условиях для ручной росписи акриловыми красками понадобятся:<br><br>
                - изделие (майка, бандана, кеды, шорты, джинсовка и т.д.)<br>
                - кисти для рисования, <br>
                - черный маркер или остро заточенный простой карандаш,<br>
                - зажимы для бумаги или бельевые прищепки,<br>
                - картон в качестве подложки внутрь изделия,<br>
                - акриловые краски по ткани (на наших мастер-классах используются светло-синий, мятный и светло-розовый цвета),<br>
                - а также расходные материалы, такие как клеенка, стаканчик для воды, палитра для смешивания красок и салфетки.<br>
                <br>
                Дайте свободу своему творчеству и не забудьте хорошо просушить (для полного застывания акриловых красок нужно около 24 часов) ваше изделие!
            </p>
            <br> 
        </div>
    </FactModal>
</template>

<script lang="ts" setup>
import FactModal from "@/components/FactModal.vue";
import img from "@/assets/pics/tshirt.png";



const emit = defineEmits(['close', 'quiz']);



function close() {
    emit('close');
}


</script>

<style lang="scss">

</style>