interface ResultType {
    [key: string]: string;
    yellow: string;
    blue: string;
    green: string;
    pink: string;
}

const result: ResultType =  {
    "yellow": "Вы любите яркие и солнечные оттенки. Ваш стиль - это веселье и оптимизм. Вы всегда находите позитивные моменты во всем, что вас окружает.",
    "blue": "Вы предпочитаете таинственные и загадочные оттенки. Ваш стиль - это загадка и интрига. Вы умеете создавать атмосферу загадочности вокруг себя.",
    "green": "Вы цените природу и спокойствие. Ваш стиль - это гармония и уравновешенность. Вы умеете находить баланс и покой в суете повседневной жизни.",
    "pink": "Вы обожаете нежные и романтические оттенки. Ваш стиль - это женственность и нежность. Вы умеете создавать атмосферу уюта и тепла вокруг себя."
}
export default result;